In [2]:
import pandas as pd
import matplotlib.pyplot as plt
from datasets import load_dataset

dataset = load_dataset('lukebarousse/data_jobs')

df = dataset['train'].to_pandas()

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

c:\Users\soods\anaconda3\envs\python_project_course\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [3]:
df.loc[:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [4]:
median_salary_year = df['salary_year_avg'].median()

In [5]:
median_slary_hour = df['salary_hour_avg'].median()

In [6]:
df_filled = df

df_filled['salary_year_avg']= df_filled['salary_year_avg'].fillna(median_salary_year)

df_filled['salary_year_avg'].head()

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
Name: salary_year_avg, dtype: float64

In [7]:
df_filled['salary_hour_avg']= df_filled['salary_hour_avg'].fillna(median_slary_hour)

df_filled['salary_hour_avg'].head()

0    45.98
1    45.98
2    45.98
3    45.98
4    45.98
Name: salary_hour_avg, dtype: float64

In [8]:
df_filled.loc[:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [12]:
df_unique=df_filled

df_unique = df_unique.drop_duplicates()

print('filled dataframe length = ',len(df_filled))
print(f'removed dublicate dataframe length = {len(df_unique)}')
print('difference in length =',len(df_filled) - len(df_unique))

filled dataframe length =  785741
removed dublicate dataframe length = 785640
difference in length = 101

In [13]:
df_unique = df_unique.drop_duplicates(subset=['job_title','company_name'])

print('filled dataframe length = ',len(df_filled))
print(f'removed dublicate dataframe length = {len(df_unique)}')
print('difference in length =',len(df_filled) - len(df_unique))

filled dataframe length =  785741
removed dublicate dataframe length = 508042
difference in length = 277699